hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_timer.h
    @return Timer bit width.
*/
__STATIC_INLINE nrf_timer_bit_width_t nrf_timer_bit_width_get(NRF_TIMER_Type *p_reg);

/**
    @brief Function for setting the timer frequency.

    @param[in] p_reg     Pointer to the peripheral registers structure.
    @param[in] frequency Timer frequency.
*/
__STATIC_INLINE void nrf_timer_frequency_set(NRF_TIMER_Type *p_reg,
                                             nrf_timer_frequency_t frequency);
                                             
/**
    @brief Function for retrieving the timer frequency.

    @param[in] p_reg Pointer to the peripheral registers structure.

    @return Timer frequency.
*/
__STATIC_INLINE nrf_timer_frequency_t nrf_timer_frequency_get(NRF_TIMER_Type *p_reg);

/**
    @brief Function for writing the capture/compare register for a specified channel.

    @param[in] p_reg      Pointer to the peripheral registers structure.
    @param[in] cc_channel Requested capture/compare channel.
    @param[in] cc_value   Value to write to the capture/compare register.
*/
__STATIC_INLINE void nrf_timer_cc_write(NRF_TIMER_Type *p_reg,
                                        nrf_timer_cc_channel_t cc_channel,
                                        uint32_t               cc_value);
                                        
/**
    @brief Function for retrieving the capture/compare value for a specified channel.

    @param[in] p_reg      Pointer to the peripheral registers structure.
    @param[in] cc_channel Requested capture/compare channel.

    @return Value from the requested capture/compare register.
*/
__STATIC_INLINE uint32_t nrf_timer_cc_read(NRF_TIMER_Type *p_reg,
                                           nrf_timer_cc_channel_t cc_channel);
                                           
/**
    @brief Function for getting a specific timer capture task.

    @param[in] channel Capture channel.

    @return Capture task.
*/
__STATIC_INLINE nrf_timer_task_t nrf_timer_capture_task_get(uint32_t channel);

/**
    @brief Function for getting a specific timer compare event.

    @param[in] channel Compare channel.

    @return Compare event.
*/
__STATIC_INLINE nrf_timer_event_t nrf_timer_compare_event_get(uint32_t channel);

/**
    @brief Function for getting a specific timer compare interrupt.

    @param[in] channel Compare channel.

    @return Compare interrupt.
*/
__STATIC_INLINE nrf_timer_int_mask_t nrf_timer_compare_int_get(uint32_t channel);

/**
    @brief Function for calculating the number of timer ticks for a given time
          (in microseconds) and timer frequency.

    @param[in] time_us   Time in microseconds.
    @param[in] frequency Timer frequency.

    @return Number of timer ticks.
*/
__STATIC_INLINE uint32_t nrf_timer_us_to_ticks(uint32_t time_us,
                                               nrf_timer_frequency_t frequency);
                                               
/**
    @brief Function for calculating the number of timer ticks for a given time
          (in milliseconds) and timer frequency.

    @param[in] time_ms   Time in milliseconds.
    @param[in] frequency Timer frequency.

    @return Number of timer ticks.
*/
__STATIC_INLINE uint32_t nrf_timer_ms_to_ticks(uint32_t time_ms,
                                               nrf_timer_frequency_t frequency);
                                               
                                               
#ifndef SUPPRESS_INLINE_IMPLEMENTATION
                                               
__STATIC_INLINE void nrf_timer_task_trigger(NRF_TIMER_Type *p_reg,
                                            nrf_timer_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

__STATIC_INLINE uint32_t *nrf_timer_task_address_get(NRF_TIMER_Type *p_reg,
                                                     nrf_timer_task_t task)
{
    return (uint32_t *)((uint8_t *)p_reg + (uint32_t)task);
}

__STATIC_INLINE void nrf_timer_event_clear(NRF_TIMER_Type *p_reg,
                                           nrf_timer_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
    #if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event));
    (void)dummy;
    #endif
}

__STATIC_INLINE bool nrf_timer_event_check(NRF_TIMER_Type *p_reg,
                                           nrf_timer_event_t event)
{
    return (bool) * (volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event);
}

__STATIC_INLINE uint32_t *nrf_timer_event_address_get(NRF_TIMER_Type *p_reg,
                                                      nrf_timer_event_t event)
{
    return (uint32_t *)((uint8_t *)p_reg + (uint32_t)event);
}

__STATIC_INLINE void nrf_timer_shorts_enable(NRF_TIMER_Type *p_reg,
                                             uint32_t timer_shorts_mask)
{
    p_reg->SHORTS |= timer_shorts_mask;
}

__STATIC_INLINE void nrf_timer_shorts_disable(NRF_TIMER_Type *p_reg,
                                              uint32_t timer_shorts_mask)
{
    p_reg->SHORTS &= ~(timer_shorts_mask);
}

__STATIC_INLINE void nrf_timer_int_enable(NRF_TIMER_Type *p_reg,
                                          uint32_t timer_int_mask)
{
    p_reg->INTENSET = timer_int_mask;
}

__STATIC_INLINE void nrf_timer_int_disable(NRF_TIMER_Type *p_reg,
                                           uint32_t timer_int_mask)
{
    p_reg->INTENCLR = timer_int_mask;
}

__STATIC_INLINE bool nrf_timer_int_enable_check(NRF_TIMER_Type *p_reg,
                                                uint32_t timer_int)
{
    return (bool)(p_reg->INTENSET & timer_int);
}

__STATIC_INLINE void nrf_timer_mode_set(NRF_TIMER_Type *p_reg,
                                        nrf_timer_mode_t mode)
{
    p_reg->MODE = (p_reg->MODE & ~TIMER_MODE_MODE_Msk) |
                  ((mode << TIMER_MODE_MODE_Pos) & TIMER_MODE_MODE_Msk);
}

__STATIC_INLINE nrf_timer_mode_t nrf_timer_mode_get(NRF_TIMER_Type *p_reg)
{
    return (nrf_timer_mode_t)(p_reg->MODE);
}

__STATIC_INLINE void nrf_timer_bit_width_set(NRF_TIMER_Type *p_reg,
                                             nrf_timer_bit_width_t bit_width)
{
    p_reg->BITMODE = (p_reg->BITMODE & ~TIMER_BITMODE_BITMODE_Msk) |
                     ((bit_width << TIMER_BITMODE_BITMODE_Pos) &
                      TIMER_BITMODE_BITMODE_Msk);
}

__STATIC_INLINE nrf_timer_bit_width_t nrf_timer_bit_width_get(NRF_TIMER_Type *p_reg)
{
    return (nrf_timer_bit_width_t)(p_reg->BITMODE);
}

